; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-32-30)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 room31 room32 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 - object)
(:init
(at-robby robot1 room8)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room22)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room23)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room2)
(at ball2 room25)
(at ball3 room30)
(at ball4 room31)
(at ball5 room16)
(at ball6 room22)
(at ball7 room25)
(at ball8 room2)
(at ball9 room12)
(at ball10 room12)
(at ball11 room31)
(at ball12 room5)
(at ball13 room30)
(at ball14 room31)
(at ball15 room17)
(at ball16 room21)
(at ball17 room2)
(at ball18 room12)
(at ball19 room15)
(at ball20 room3)
(at ball21 room5)
(at ball22 room5)
(at ball23 room13)
(at ball24 room17)
(at ball25 room11)
(at ball26 room29)
(at ball27 room14)
(at ball28 room10)
(at ball29 room4)
(at ball30 room3)
)
(:goal
(and
(at ball1 room32)
(at ball2 room6)
(at ball3 room28)
(at ball4 room30)
(at ball5 room4)
(at ball6 room12)
(at ball7 room19)
(at ball8 room29)
(at ball9 room13)
(at ball10 room31)
(at ball11 room9)
(at ball12 room12)
(at ball13 room4)
(at ball14 room6)
(at ball15 room10)
(at ball16 room20)
(at ball17 room26)
(at ball18 room12)
(at ball19 room31)
(at ball20 room9)
(at ball21 room14)
(at ball22 room3)
(at ball23 room14)
(at ball24 room27)
(at ball25 room20)
(at ball26 room25)
(at ball27 room24)
(at ball28 room1)
(at ball29 room2)
(at ball30 room27)
)
)
)

; plan
1. (pick robot2 ball6 room22 lgripper2)
   deleted: (at ball6 room22) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 1 of 30
2. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 1 of 30
3. (move robot3 room23 room12)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room12)
   goals met: 1 of 30
4. (move robot2 room22 room12)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room12)
   goals met: 1 of 30
5. (pick robot3 ball9 room12 lgripper3)
   deleted: (at ball9 room12) (free robot3 lgripper3)
   added: (carry robot3 ball9 lgripper3)
   goals met: 1 of 30
6. (pick robot3 ball10 room12 rgripper3)
   deleted: (at ball10 room12) (free robot3 rgripper3)
   added: (carry robot3 ball10 rgripper3)
   goals met: 1 of 30
7. (move robot1 room9 room21)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room21)
   goals met: 1 of 30
8. (drop robot2 ball6 room12 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room12) (free robot2 lgripper2)
   goals met: 2 of 30
9. (move robot3 room12 room31)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room31)
   goals met: 2 of 30
10. (pick robot1 ball16 room21 lgripper1)
   deleted: (at ball16 room21) (free robot1 lgripper1)
   added: (carry robot1 ball16 lgripper1)
   goals met: 2 of 30
11. (drop robot3 ball10 room31 rgripper3)
   deleted: (carry robot3 ball10 rgripper3)
   added: (at ball10 room31) (free robot3 rgripper3)
   goals met: 3 of 30
12. (move robot1 room21 room20)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room20)
   goals met: 3 of 30
13. (move robot2 room12 room9)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room9)
   goals met: 3 of 30
14. (move robot3 room31 room13)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room13)
   goals met: 3 of 30
15. (drop robot1 ball16 room20 lgripper1)
   deleted: (carry robot1 ball16 lgripper1)
   added: (at ball16 room20) (free robot1 lgripper1)
   goals met: 4 of 30
16. (move robot2 room9 room6)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room6)
   goals met: 4 of 30
17. (drop robot3 ball9 room13 lgripper3)
   deleted: (carry robot3 ball9 lgripper3)
   added: (at ball9 room13) (free robot3 lgripper3)
   goals met: 5 of 30
18. (pick robot3 ball23 room13 rgripper3)
   deleted: (at ball23 room13) (free robot3 rgripper3)
   added: (carry robot3 ball23 rgripper3)
   goals met: 5 of 30
19. (move robot1 room20 room11)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room11)
   goals met: 5 of 30
20. (move robot2 room6 room9)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room9)
   goals met: 5 of 30
21. (move robot3 room13 room14)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room14)
   goals met: 5 of 30
22. (pick robot1 ball25 room11 lgripper1)
   deleted: (at ball25 room11) (free robot1 lgripper1)
   added: (carry robot1 ball25 lgripper1)
   goals met: 5 of 30
23. (move robot2 room9 room5)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room5)
   goals met: 5 of 30
24. (drop robot3 ball23 room14 rgripper3)
   deleted: (carry robot3 ball23 rgripper3)
   added: (at ball23 room14) (free robot3 rgripper3)
   goals met: 6 of 30
25. (move robot1 room11 room20)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room20)
   goals met: 6 of 30
26. (pick robot3 ball27 room14 lgripper3)
   deleted: (at ball27 room14) (free robot3 lgripper3)
   added: (carry robot3 ball27 lgripper3)
   goals met: 6 of 30
27. (pick robot2 ball22 room5 lgripper2)
   deleted: (at ball22 room5) (free robot2 lgripper2)
   added: (carry robot2 ball22 lgripper2)
   goals met: 6 of 30
28. (drop robot1 ball25 room20 lgripper1)
   deleted: (carry robot1 ball25 lgripper1)
   added: (at ball25 room20) (free robot1 lgripper1)
   goals met: 7 of 30
29. (move robot3 room14 room24)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room24)
   goals met: 7 of 30
30. (move robot2 room5 room2)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room2)
   goals met: 7 of 30
31. (drop robot3 ball27 room24 lgripper3)
   deleted: (carry robot3 ball27 lgripper3)
   added: (at ball27 room24) (free robot3 lgripper3)
   goals met: 8 of 30
32. (move robot1 room20 room5)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room5)
   goals met: 8 of 30
33. (pick robot2 ball8 room2 rgripper2)
   deleted: (at ball8 room2) (free robot2 rgripper2)
   added: (carry robot2 ball8 rgripper2)
   goals met: 8 of 30
34. (pick robot1 ball21 room5 lgripper1)
   deleted: (at ball21 room5) (free robot1 lgripper1)
   added: (carry robot1 ball21 lgripper1)
   goals met: 8 of 30
35. (pick robot1 ball12 room5 rgripper1)
   deleted: (at ball12 room5) (free robot1 rgripper1)
   added: (carry robot1 ball12 rgripper1)
   goals met: 8 of 30
36. (move robot2 room2 room3)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room3)
   goals met: 8 of 30
37. (move robot3 room24 room9)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room9)
   goals met: 8 of 30
38. (move robot1 room5 room14)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room14)
   goals met: 8 of 30
39. (drop robot2 ball22 room3 lgripper2)
   deleted: (carry robot2 ball22 lgripper2)
   added: (at ball22 room3) (free robot2 lgripper2)
   goals met: 9 of 30
40. (move robot3 room9 room6)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room6)
   goals met: 9 of 30
41. (drop robot1 ball21 room14 lgripper1)
   deleted: (carry robot1 ball21 lgripper1)
   added: (at ball21 room14) (free robot1 lgripper1)
   goals met: 10 of 30
42. (move robot2 room3 room29)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room29)
   goals met: 10 of 30
43. (move robot3 room6 room4)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room4)
   goals met: 10 of 30
44. (move robot1 room14 room12)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room12)
   goals met: 10 of 30
45. (drop robot2 ball8 room29 rgripper2)
   deleted: (carry robot2 ball8 rgripper2)
   added: (at ball8 room29) (free robot2 rgripper2)
   goals met: 11 of 30
46. (pick robot2 ball26 room29 lgripper2)
   deleted: (at ball26 room29) (free robot2 lgripper2)
   added: (carry robot2 ball26 lgripper2)
   goals met: 11 of 30
47. (pick robot3 ball29 room4 lgripper3)
   deleted: (at ball29 room4) (free robot3 lgripper3)
   added: (carry robot3 ball29 lgripper3)
   goals met: 11 of 30
48. (drop robot1 ball12 room12 rgripper1)
   deleted: (carry robot1 ball12 rgripper1)
   added: (at ball12 room12) (free robot1 rgripper1)
   goals met: 12 of 30
49. (move robot2 room29 room25)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room25)
   goals met: 12 of 30
50. (move robot3 room4 room2)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room2)
   goals met: 12 of 30
51. (drop robot2 ball26 room25 lgripper2)
   deleted: (carry robot2 ball26 lgripper2)
   added: (at ball26 room25) (free robot2 lgripper2)
   goals met: 13 of 30
52. (drop robot3 ball29 room2 lgripper3)
   deleted: (carry robot3 ball29 lgripper3)
   added: (at ball29 room2) (free robot3 lgripper3)
   goals met: 14 of 30
53. (pick robot2 ball7 room25 rgripper2)
   deleted: (at ball7 room25) (free robot2 rgripper2)
   added: (carry robot2 ball7 rgripper2)
   goals met: 14 of 30
54. (move robot1 room12 room9)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room9)
   goals met: 14 of 30
55. (pick robot3 ball17 room2 rgripper3)
   deleted: (at ball17 room2) (free robot3 rgripper3)
   added: (carry robot3 ball17 rgripper3)
   goals met: 14 of 30
56. (move robot2 room25 room19)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room19)
   goals met: 14 of 30
57. (move robot3 room2 room26)
   deleted: (at-robby robot3 room2)
   added: (at-robby robot3 room26)
   goals met: 14 of 30
58. (move robot1 room9 room2)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room2)
   goals met: 14 of 30
59. (drop robot2 ball7 room19 rgripper2)
   deleted: (carry robot2 ball7 rgripper2)
   added: (at ball7 room19) (free robot2 rgripper2)
   goals met: 15 of 30
60. (drop robot3 ball17 room26 rgripper3)
   deleted: (carry robot3 ball17 rgripper3)
   added: (at ball17 room26) (free robot3 rgripper3)
   goals met: 16 of 30
61. (pick robot1 ball1 room2 lgripper1)
   deleted: (at ball1 room2) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 16 of 30
62. (move robot1 room2 room32)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room32)
   goals met: 16 of 30
63. (move robot2 room19 room9)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room9)
   goals met: 16 of 30
64. (move robot3 room26 room31)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room31)
   goals met: 16 of 30
65. (drop robot1 ball1 room32 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room32) (free robot1 lgripper1)
   goals met: 17 of 30
66. (pick robot3 ball4 room31 lgripper3)
   deleted: (at ball4 room31) (free robot3 lgripper3)
   added: (carry robot3 ball4 lgripper3)
   goals met: 17 of 30
67. (move robot2 room9 room6)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room6)
   goals met: 17 of 30
68. (move robot3 room31 room30)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room30)
   goals met: 17 of 30
69. (move robot1 room32 room9)
   deleted: (at-robby robot1 room32)
   added: (at-robby robot1 room9)
   goals met: 17 of 30
70. (move robot2 room6 room31)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room31)
   goals met: 17 of 30
71. (drop robot3 ball4 room30 lgripper3)
   deleted: (carry robot3 ball4 lgripper3)
   added: (at ball4 room30) (free robot3 lgripper3)
   goals met: 18 of 30
72. (pick robot3 ball3 room30 rgripper3)
   deleted: (at ball3 room30) (free robot3 rgripper3)
   added: (carry robot3 ball3 rgripper3)
   goals met: 18 of 30
73. (pick robot2 ball14 room31 lgripper2)
   deleted: (at ball14 room31) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 18 of 30
74. (move robot1 room9 room31)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room31)
   goals met: 18 of 30
75. (move robot3 room30 room28)
   deleted: (at-robby robot3 room30)
   added: (at-robby robot3 room28)
   goals met: 18 of 30
76. (move robot2 room31 room6)
   deleted: (at-robby robot2 room31)
   added: (at-robby robot2 room6)
   goals met: 18 of 30
77. (pick robot1 ball11 room31 lgripper1)
   deleted: (at ball11 room31) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 18 of 30
78. (drop robot3 ball3 room28 rgripper3)
   deleted: (carry robot3 ball3 rgripper3)
   added: (at ball3 room28) (free robot3 rgripper3)
   goals met: 19 of 30
79. (drop robot2 ball14 room6 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room6) (free robot2 lgripper2)
   goals met: 20 of 30
80. (move robot1 room31 room9)
   deleted: (at-robby robot1 room31)
   added: (at-robby robot1 room9)
   goals met: 20 of 30
81. (move robot3 room28 room9)
   deleted: (at-robby robot3 room28)
   added: (at-robby robot3 room9)
   goals met: 20 of 30
82. (move robot2 room6 room25)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room25)
   goals met: 20 of 30
83. (drop robot1 ball11 room9 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room9) (free robot1 lgripper1)
   goals met: 21 of 30
84. (pick robot2 ball2 room25 lgripper2)
   deleted: (at ball2 room25) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 21 of 30
85. (move robot1 room9 room15)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room15)
   goals met: 21 of 30
86. (move robot3 room9 room30)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room30)
   goals met: 21 of 30
87. (move robot2 room25 room6)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room6)
   goals met: 21 of 30
88. (pick robot1 ball19 room15 lgripper1)
   deleted: (at ball19 room15) (free robot1 lgripper1)
   added: (carry robot1 ball19 lgripper1)
   goals met: 21 of 30
89. (pick robot3 ball13 room30 lgripper3)
   deleted: (at ball13 room30) (free robot3 lgripper3)
   added: (carry robot3 ball13 lgripper3)
   goals met: 21 of 30
90. (move robot1 room15 room31)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room31)
   goals met: 21 of 30
91. (drop robot2 ball2 room6 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room6) (free robot2 lgripper2)
   goals met: 22 of 30
92. (move robot3 room30 room16)
   deleted: (at-robby robot3 room30)
   added: (at-robby robot3 room16)
   goals met: 22 of 30
93. (drop robot1 ball19 room31 lgripper1)
   deleted: (carry robot1 ball19 lgripper1)
   added: (at ball19 room31) (free robot1 lgripper1)
   goals met: 23 of 30
94. (pick robot3 ball5 room16 rgripper3)
   deleted: (at ball5 room16) (free robot3 rgripper3)
   added: (carry robot3 ball5 rgripper3)
   goals met: 23 of 30
95. (move robot2 room6 room9)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room9)
   goals met: 23 of 30
96. (move robot3 room16 room4)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room4)
   goals met: 23 of 30
97. (move robot1 room31 room9)
   deleted: (at-robby robot1 room31)
   added: (at-robby robot1 room9)
   goals met: 23 of 30
98. (move robot2 room9 room3)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room3)
   goals met: 23 of 30
99. (drop robot3 ball5 room4 rgripper3)
   deleted: (carry robot3 ball5 rgripper3)
   added: (at ball5 room4) (free robot3 rgripper3)
   goals met: 24 of 30
100. (drop robot3 ball13 room4 lgripper3)
   deleted: (carry robot3 ball13 lgripper3)
   added: (at ball13 room4) (free robot3 lgripper3)
   goals met: 25 of 30
101. (pick robot2 ball30 room3 lgripper2)
   deleted: (at ball30 room3) (free robot2 lgripper2)
   added: (carry robot2 ball30 lgripper2)
   goals met: 25 of 30
102. (pick robot2 ball20 room3 rgripper2)
   deleted: (at ball20 room3) (free robot2 rgripper2)
   added: (carry robot2 ball20 rgripper2)
   goals met: 25 of 30
103. (move robot1 room9 room27)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room27)
   goals met: 25 of 30
104. (move robot2 room3 room9)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room9)
   goals met: 25 of 30
105. (move robot3 room4 room27)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room27)
   goals met: 25 of 30
106. (move robot1 room27 room17)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room17)
   goals met: 25 of 30
107. (drop robot2 ball20 room9 rgripper2)
   deleted: (carry robot2 ball20 rgripper2)
   added: (at ball20 room9) (free robot2 rgripper2)
   goals met: 26 of 30
108. (pick robot1 ball24 room17 lgripper1)
   deleted: (at ball24 room17) (free robot1 lgripper1)
   added: (carry robot1 ball24 lgripper1)
   goals met: 26 of 30
109. (pick robot1 ball15 room17 rgripper1)
   deleted: (at ball15 room17) (free robot1 rgripper1)
   added: (carry robot1 ball15 rgripper1)
   goals met: 26 of 30
110. (move robot3 room27 room10)
   deleted: (at-robby robot3 room27)
   added: (at-robby robot3 room10)
   goals met: 26 of 30
111. (move robot2 room9 room27)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room27)
   goals met: 26 of 30
112. (move robot1 room17 room27)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room27)
   goals met: 26 of 30
113. (pick robot3 ball28 room10 lgripper3)
   deleted: (at ball28 room10) (free robot3 lgripper3)
   added: (carry robot3 ball28 lgripper3)
   goals met: 26 of 30
114. (drop robot2 ball30 room27 lgripper2)
   deleted: (carry robot2 ball30 lgripper2)
   added: (at ball30 room27) (free robot2 lgripper2)
   goals met: 27 of 30
115. (move robot3 room10 room1)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room1)
   goals met: 27 of 30
116. (drop robot1 ball24 room27 lgripper1)
   deleted: (carry robot1 ball24 lgripper1)
   added: (at ball24 room27) (free robot1 lgripper1)
   goals met: 28 of 30
117. (move robot1 room27 room10)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room10)
   goals met: 28 of 30
118. (drop robot3 ball28 room1 lgripper3)
   deleted: (carry robot3 ball28 lgripper3)
   added: (at ball28 room1) (free robot3 lgripper3)
   goals met: 29 of 30
119. (drop robot1 ball15 room10 rgripper1)
   deleted: (carry robot1 ball15 rgripper1)
   added: (at ball15 room10) (free robot1 rgripper1)
   goals met: 30 of 30
